changelog = r"""
## 変更履歴
**This file is translated by AI. And just for reference.**
### V4-2503アップデート：
#### バージョンをより明確にするため、リリース日付に加えてバージョン番号が付けられます。
#### このアップデート後、前のバージョンの合成履歴と保存された話者は再作成する必要があります。そうしないと、エラーが発生する可能性があります！
1. 字幕編集
2. 字幕翻訳
3. 様々な詳細が改善され、バグが修正されました
4. CosyVoice2をサポート（GSVパネルを再利用）
5. (4.0.1) バッチモード
6. (4.1) サーバーモード
7. (4.2) 国際化（I18n）

### 250214アップデート：
1. 過去のプロジェクトの読み込みをサポート
2. 複数話者によるダビングをサポート

### 250123アップデート：
1. 合成後の実際の開始と終了タイムスタンプに一致するSRT字幕ファイルの再エクスポートをサポートします。また、合成のためのTXTテキストファイルの読み込みもサポートし、この場合、段落は文で分割されます。
2. 将来的な拡張性と簡素化を高めるため、ダウンロードをより便利にする単一のスクリプトファイルの設計を断念せざるを得ません。このバージョンからコードの再設計が始まりました。
3. いくつかのドキュメントを追加しました。

### 240811アップデート：
1. エラーメッセージをユーザーに通知
2. TTSプロジェクトの環境を自動検出
3. api-v1との互換性を回復
4. メジャーな機能アップデート：特定の行に不満がある場合、それらを再生成する機能をサポート 
"""
